# Py-Version:3.8
from smtplib import SMTP
from email.header import Header
from email.mime.text import MIMEText


def main():
    # 请自行修改下面的邮件发送者和接收者
    sender = 'keyoung.lau@qq.com'  # 发送者的邮箱地址
    receivers = ['610856109@qq.com']  # 接收者的邮箱地址
    text = """
我们在田野散步：我，我的母亲，我的妻子和儿子。
母亲本不愿出来的。她老了，身体不好，走远一点就觉得很累。我说，正因为如此，才应该多走走，母亲信服地点点头，便去拿外套。她很听我的话，就像我小时候很听她的话一样。
天气很好。今年的春天来的太迟，太迟了。有一些老人挺不住。但是春天总算来了。我的母亲又熬过了一个冬季。
这南方初春的田野，大块小块的新绿随意地铺着，有的浓，有的淡；树上的绿芽也密了；田野里的冬水也咕咕地起着水泡。这一切使人想起一样东西——生命。
我和母亲走在前面，我的妻子和儿子走在后面。小家伙突然叫起来：“前面也是妈妈和儿子，后面也是妈妈和儿子。”我们都笑了。
后来发生了分歧：母亲要走大路，大路平顺；我的儿子要走小路，小路有意思。不过，一切都取决于我。我的母亲老了，她早已习惯听从她强壮的儿子；我的儿子还小，他还习惯听从他高大的父亲；妻子呢， 在外面，她总是听我的。一霎时我感到了责任的重大，就像民族领袖在严重关头时那样。我想找一个两全的办法，找不出；我想拆散一家人，分成两路，各得其所，终不愿意。我决定委屈儿子，因为我伴同他的时日还长。我说：“走大路。”
但是母亲摸摸孙儿的小脑瓜，变了主意：“还是走小路吧。”她的眼随小路望去：那里有金色的菜花，两行整齐的桑树，尽头一口水波粼粼的鱼塘。“我走不过去的地方，你就背着我。”母亲对我说。
这样，我们在阳光下，向着那菜花、桑树和鱼塘走去。到了一处，我蹲下来，背起了母亲，妻子也蹲下来，背起了儿子。我的母亲虽然高大，然而很瘦，自然不算重；儿子虽然很胖，毕竟幼小，自然也轻。但我和妻子都是慢慢地，稳稳地，走得很仔细，好像我背上的同她背上的加起来，就是整个世界。
    """
    message = MIMEText(text, _subtype='plain', _charset='utf-8')
    message['From'] = Header('Keyoung.lau', 'utf-8')  # 邮件的发送者
    message['To'] = Header('Hua.li', 'utf-8')  # 邮件的接收者
    message['Subject'] = Header('散步', 'utf-8')  # 邮件的标题
    smtper = SMTP('smtp.qq.com')
    # 请自行修改下面的登录口令
    smtper.login(sender, '这里填QQ邮箱smtp的授权码')  # QQ邮箱smtp的授权码
    smtper.sendmail(sender, receivers, message.as_string())
    print('邮件发送完成!')


if __name__ == '__main__':
    main()
